pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/include/sl_types.h
/*******************************************************************************
**+--------------------------------------------------------------------------+**
**|                                                                          |**
**|         Copyright (c) 2012 Texas Instruments Incorporated                |**
**|                        ALL RIGHTS RESERVED                               |**
**|                                                                          |**
**| Permission is hereby granted to licensees of Texas Instruments           |**
**| Incorporated (TI) products to use this computer program for the sole     |**
**| purpose of implementing a licensee product based on TI products.         |**
**| No other rights to reproduce, use, or disseminate this computer          |**
**| program, whether in part or in whole, are granted.                       |**
**|                                                                          |**
**| TI makes no representation or warranties with respect to the             |**
**| performance of this computer program, and specifically disclaims         |**
**| any responsibility for any damages, special or consequential,            |**
**| connected with the use of this program.                                  |**
**|                                                                          |**
**+--------------------------------------------------------------------------+**
*******************************************************************************/
/**
 * @file        sl_types.h
 * @version     2.2.0
 * @brief       File contains the types used by the SafeTI&trade; Hercules&trade; Diagnostic Library APIs
 *
 * @details       The macros,enumerations,structures which are used within the\n
 sl_selftest.c file are to be declared here.This files serves as a type file for\n
 the SafeTI&trade; Hercules&trade; Diagnostic library the types specific for the SafeTI&trade; Hercules&trade; Diagnostic library API's are\n
 declared here.
 */
#ifndef __SL_TYPES_H__
#define __SL_TYPES_H__

#include "sl_sys_common.h"
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
#include "reg_bitdefn_adc.h" /* \todo Need to remove this dependency */
#endif



/** \defgroup FLASHECCConfig Macros for F021Flash ECC Configuration
 *
 *  Following macros are to be used for the ctrlFlags parameter of SL_Init_ECCFlash API
 *
 */
/**@{*/
#define FLASHECC_E0FEN  (uint32)(1U << 10)    /**< Enable Error on Fail event */
#define FLASHECC_EZFEN  (uint32)(1U << 9)     /**< Enable Error on Zero Fail event */
#define FLASHECC_EPEN   (uint32)(1U << 8)     /**< Enable Error profiling */
#define FLASHECC_EOCV   (uint32)(1U << 5)     /**< Enable One Condition valid */
#define FLASHECC_EZCV   (uint32)(1U << 4)     /**< Enable Zero Condition Valid */
#define FLASHECC_DEFAULT  (uint32)(F021F_FEDACCTRL1_E0FEN | F021F_FEDACCTRL1_EZFEN)    /**< Default flag combination */
/**@}*/



/** \defgroup ESMChannels Macros for ESM Channel assignments
 *
 *  Following macros are used by the ESM Handler as a parameter (channel) to the application
 *  callback. Refer to ESM_Application_Callback definition for details
 *
 *  Naming Convention: ESM_G<number>ERR_<module>_<error type>
 */
/**@{*/
#define ESM_G3ERR_EFUSE_AUTOLOAD_ERR   (uint32)(1u)   /**< ESM Group 3 - eFuse
                                                        Auto Load error */

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
#define ESM_G3ERR_B0TCM_ECC_UNCORR     (uint32)(3u)   /**< ESM Group 3 - RAM
                                                        Even Bank (B0TCM)
                                                        Uncorrectable ECC error
                                                       */
#define ESM_G3ERR_B1TCM_ECC_UNCORR     (uint32)(5u)   /**< ESM Group 3 - RAM Odd
                                                        bank (B1TCM)
                                                        Uncorrectable ECC error
                                                       */
#define ESM_G3ERR_FMC_UNCORR           (uint32)(7u)   /**< ESM Group 3 - Flash
                                                        Uncorrectable error
                                                        (bus1 & bus2) */

#define ESM_G2ERR_CCMR4_COMP           (uint32)(2u)    /**< ESM Group 2 - CCMR4
                                                         Compare error */
#define ESM_G2ERR_B0TCM_UNCORR           (uint32)(6u)    /**< ESM Group 2 - TCM
                                                           RAM Even Bank (B0TCM)
                                                           - Uncorrectable error
                                                          */
#define ESM_G2ERR_B1TCM_UNCORR           (uint32)(8u)    /**< ESM Group 2 - TCM
                                                           RAM Odd Bank (B1TCM)
                                                           - Uncorrectable error
                                                          */
#define ESM_G2ERR_B0TCM_ADDPAR           (uint32)(10u)   /**< ESM Group 2 - TCM
                                                           RAM Even Bank (B0TCM)
                                                           - Address bus parity
                                                           error */
#define ESM_G2ERR_B1TCM_ADDPAR           (uint32)(12u)   /**< ESM Group 2 - TCM
                                                           RAM Odd Bank (B1TCM)
                                                           - Address bus parity
                                                           error */
#define ESM_G2ERR_FMC_UNCORR           (uint32)(4u)    /**< ESM Group 2 -
                                                         F021Flash Uncorrectable
                                                         error (address parity
                                                         on bus1 accesses) */
#define ESM_G2ERR_FLASH_LIVLCK           (uint32)(16u)   /**< ESM Group 2 -
                                                           Flash (ATCM - ECC
                                                           Live lock detect) */
#define ESM_G2ERR_RTI_WWD_NMI           (uint32)(24u)   /**< ESM Group 2 - RTI
                                                          Windowed WatchDog NMI
                                                         */

#define ESM_G1ERR_FMC_CORR               (uint32)(6u)    /**< ESM Group 1 - F021
                                                           Flash Correctable
                                                           error (Bus 1 & 2) */
#define ESM_G1ERR_PLL1_SLIP            (uint32)(10u)   /**< ESM Group 1 - PLL1
                                                         Slip error */
#define ESM_G1ERR_CLOCKMON_INTR        (uint32)(11u)   /**< ESM Group 1 - Clock
                                                         monitor interrupt */
#define ESM_G1ERR_VIMRAM_PARITY        (uint32)(15u)   /**< ESM Group 1 - VIM
                                                         RAM Parity error */
#define ESM_G1ERR_B0TCM_CORRERR        (uint32)(26u)   /**< ESM Group 1 - RAM
                                                         Even bank (B0TCM)
                                                         correctable error */
#define ESM_G1ERR_B1TCM_CORRERR        (uint32)(28u)   /**< ESM Group 1 - RAM
                                                         Odd bank (B1TCM)
                                                         correctable error */
#define ESM_G1ERR_DCC1_ERR             (uint32)(30u)   /**< ESM Group 1 - DCC1
                                                         error */
#define ESM_G1ERR_CCMR4_SELFTEST       (uint32)(31u)   /**< ESM Group 1 - CCMR4
                                                         Selftest error */
#define ESM_G1ERR_EEPROM_CORRERR       (uint32)(35u)   /**< ESM Group 1 - Flash
                                                         EEPROM Correctable
                                                         error */
#define ESM_G1ERR_EEPROM_UNCORRERR     (uint32)(36u)   /**< ESM Group 1 - Flash
                                                         EEPROM Uncorrectable
                                                         error */
#define ESM_G1ERR_PSCON_COMPARE_ERR    (uint32)(38u)   /**< ESM Group 1 - Power
                                                         Domain Controller -
                                                         Compare Error */
#define ESM_G1ERR_PSCON_SELTEST_ERR    (uint32)(39u)   /**< ESM Group 1 - Power
                                                         Domain Controller -
                                                         Self-Test Error */
#define ESM_G1ERR_PLL2_SLIP            (uint32)(42u)   /**< ESM Group 1 - PLL2
                                                         Slip error */
#define ESM_G1ERR_DCC2_ERR             (uint32)(62u)   /**< ESM Group 1 - DCC2
                                                         error */
#endif
#define ESM_G1ERR_EFUSE_ERR_OTHER      (uint32)(40u)   /**< ESM Group 1 - Power
                                                         Domain Controller -
                                                         Self-Test Error */
#define ESM_G1ERR_EFUSE_SELTEST_ERR    (uint32)(41u)   /**< ESM Group 1 - Power
                                                         Domain Controller -
                                                         Self-Test Error */


#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
#define ESM_G2ERR_CCMR5_CPUCOMP_ERR    (uint32)(2u)    /**< ESM Group 2 - CCMR5
                                                         Compare error */
#define ESM_G2ERR_CCMR5_VIMCOMP_ERR    (uint32)(25u)   /**< ESM Group 2 - CCMR5
                                                         Compare error */
#define ESM_G2ERR_CCMR5_INMCOMP_ERR    (uint32)(26u)   /**< ESM Group 2 - CCMR5
                                                         Compare error */
#define ESM_G2ERR_CCMR5_PDCOMP_ERR     (uint32)(28u)   /**< ESM Group 2 - CCMR5
                                                         Compare error */
#define ESM_G2ERR_CR5_BUSERR           (uint32)(3u)    /**< ESM Group 2 - R5 Bus
                                                         error */
#define ESM_G2ERR_L2RAMW_UNCORR_B       (uint32)(7u)       /**< ESM Group 2 -
                                                             L2RAM Uncorrectable
                                                             error (Type B) */
#define ESM_G1ERR_L2RAMW_CORRERR       (uint32)(26u)   /**< ESM Group 1 - L2RAM
                                                         correctable error */
#define ESM_G2ERR_EPC_UNCORR           (uint32)(21u)   /**< ESM Group 2 - EPC -
                                                         ECC uncorrectable error
                                                        */
#define ESM_G1ERR_EPC_SERR             (uint32)(4u)    /**< ESM Group 1 - EPC -
                                                         ECC single bit error */

#define ESM_G1ERR_CCMR5_SELFTEST       (uint32)(31u)   /**< ESM Group 1 - CCMR5
                                                         Selftest error */

#define ESM_G1ERR_CCMR5_OPERATING_STATUS    (uint32)(92u) /**< ESM Group 1 -
                                                            CCMR5 Selftests
                                                            running */

#define ESM_G1ERR_DMA_ECC_SBERR        (uint32)(82u)   /**< ESM Group 1 - DMA -
                                                         ECC single bit error
                                                         bit */
#define ESM_G1ERR_DMA_ECC_UNCORR       (uint32)(3u)    /**< ESM Group 1 - DMA -
                                                         ECC uncorrectable error
                                                        */

#define ESM_G1ERR_CAN1_ECC_SBERR       (uint32)(73u)    /**< ESM Group 1 - DCAN1
                                                         - ECC single bit error
                                                        */
#define ESM_G1ERR_CAN1_ECC_UNCORR      (uint32)(21u)   /**< ESM Group 1 - DCAN1
                                                         - ECC uncorrectable
                                                         error */
#define ESM_G1ERR_CAN2_ECC_SBERR       (uint32)(74u)   /**< ESM Group 1 - DCAN2
                                                         - ECC single bit error
                                                        */
#define ESM_G1ERR_CAN2_ECC_UNCORR      (uint32)(23u)   /**< ESM Group 1 - DCAN2
                                                         - ECC uncorrectable
                                                         error */
#define ESM_G1ERR_CAN3_ECC_SBERR       (uint32)(75u)   /**< ESM Group 1 - DCAN3
                                                         - ECC single bit error
                                                        */
#define ESM_G1ERR_CAN3_ECC_UNCORR      (uint32)(22u)   /**< ESM Group 1 - DCAN3
                                                         - ECC uncorrectable
                                                         error */
#define ESM_G1ERR_CAN4_ECC_SBERR       (uint32)(76u)   /**< ESM Group 1 - DCAN4
                                                         - ECC single bit error
                                                        */
#define ESM_G1ERR_CAN4_ECC_UNCORR      (uint32)(51u)   /**< ESM Group 1 - DCAN4
                                                         - ECC uncorrectable
                                                         error */

#define ESM_G1ERR_SPI1_ECC_SBERR       (uint32)(77u)   /**< ESM Group 1 -
                                                         MIBSPI1 - ECC single
                                                         bit error */
#define ESM_G1ERR_SPI2_ECC_SBERR       (uint32)(78u)   /**< ESM Group 1 -
                                                         MIBSPI2 - ECC single
                                                         bit error */
#define ESM_G1ERR_SPI3_ECC_SBERR       (uint32)(79u)   /**< ESM Group 1 -
                                                         MIBSPI3 - ECC single
                                                         bit error */
#define ESM_G1ERR_SPI4_ECC_SBERR       (uint32)(80u)   /**< ESM Group 1 -
                                                         MIBSPI4 - ECC single
                                                         bit error */
#define ESM_G1ERR_SPI5_ECC_SBERR       (uint32)(81u)   /**< ESM Group 1 -
                                                         MIBSPI5 - ECC single
                                                         bit error */

#define ESM_G1ERR_SPI1_ECC_UNCORR      (uint32)(17u)   /**< ESM Group 1 -
                                                         MIBSPI1 - ECC
                                                         uncorrectable error */
#define ESM_G1ERR_SPI2_ECC_UNCORR      (uint32)(49u)   /**< ESM Group 1 -
                                                         MIBSPI2 - ECC
                                                         uncorrectable error */
#define ESM_G1ERR_SPI3_ECC_UNCORR      (uint32)(18u)   /**< ESM Group 1 -
                                                         MIBSPI3 - ECC
                                                         uncorrectable error */
#define ESM_G1ERR_SPI4_ECC_UNCORR      (uint32)(50u)   /**< ESM Group 1 -
                                                         MIBSPI4 - ECC
                                                         uncorrectable error */
#define ESM_G1ERR_SPI5_ECC_UNCORR      (uint32)(24u)   /**< ESM Group 1 -
                                                         MIBSPI5 - ECC
                                                         uncorrectable error */
#endif

/**@}*/



