pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/include/sl_types.h
/** \typedef ESM_Application_Callback
  *
  * \brief Definition for ESM Application call back type.
  * \description The esm application call back happens in case of fault
  * injections and actual device faults. There will be no callback in case of failures in the selftests.\n
  * The application should use the provided status function to get the status
  * (pass/fail) of the last selftest which was triggered.
  * \param grpchannel - ESM Channel Number and group indicator to the application.Upper 16 bits indicate the group and lower 16 bits indicate the channel.\n
  * group indicate 1- for group1 and 2- for group2.
  *
  *
  * \param param   - Additional error information. Contents & type depends on channel# and are described below
  * 
  * **NOTE: No additional error information is defined for the ESMs in case of the
  * RM57Lx and the TMS570LC43x devices currently.  The application must read the
  * appropriate error information from the module signalling the ESM directly.**
  *
  |--------------------------|-----------------------------------------------------------------------------------------|
  | channel (ESM_xxxx)       |    Description                                                                          |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G3ERR_EFUSE_AUTOLOAD_ERR |   Not Applicable                                                                        |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G3ERR_B0TCM_ECC_UNCORR   |   Not Applicable                                                                        |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G3ERR_B1TCM_ECC_UNCORR   |   Not Applicable                                                                        |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G3ERR_FMC_UNCORR         |   Not Applicable                                                                        |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G2ERR_CCMR4_COMP         |   None                                                                                  |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G2ERR_FMC_UNCORR         | param1 - In case of Bus Parity Errors [31-0] indicates address location. In case of     |
  |                          |          ECC errors [31-23] 64bit aligned address and [0-2] are 0.                      |
  |                          | param2 & param3 - RESERVED                                                              |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G2ERR_B0TCM_UNCORR       | param1 - Address which failed the parity check as an offset from the base address of    |
  |                          |          TCM RAM (0x0800_0000 by default)                                               |
  |                          | param2 & param3 - RESERVED										   					   |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G2ERR_B1TCM_UNCORR       | param2 - Address which failed the parity check as an offset from the base address of    |
  |                          |          TCM RAM (0x0800_0000 by default)                                               |
  |                          | param1 & param3 - RESERVED										   					   |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G2ERR_B0TCM_ADDPAR       | param1 -
  |                          | param2 - param[8] - 1: Indicates a Read Address Parity failure                          |
  |                          |          param[9] - 1: Indicates a Write Address Parity failure                         |
  |                          | param2[31-10], param2[7-0] & param3 - RESERVED										   |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G2ERR_B1TCM_ADDPAR       |     None                                                                                |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G2ERR_FLASH_LIVLCK       |     None                                                                                |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G2ERR_RTI_WWD_NMI        |     None                                                                                |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_FMC_CORR           | param1 - 16bit counter contains the number of correctable error occurrences             |
  |                          | param2 - 32bit CPU address for which a correctable error is detected                    |
  |                          | param3 - RESERVED                                                                       |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_PLL1_SLIP          | param1[0] - 1: Indicates a under cycle slip error                                       |
  |                          | param1[1] - 1: Indicates a over cycle slip error                                        |
  |                          | param2 & param3 - RESERVED                                                              |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_CLOCKMON_INTR      | param1, param2, param3 - RESERVED                                                       |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_VIMRAM_PARITY      | param1 - 32bit address of the first parity error location                               |
  |                          | param2, param3 - RESERVED                                                               |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_B0TCM_CORRERR      | param1[17-3] - [17-3] of the address for which the Cortex-R4F CPU detects a single-bit  |
  |                          | error                                                                                   |
  |                          | param2 & param3 - RESERVED                                                              |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_B1TCM_CORRERR      | param1[17-3] - [17-3] of the address for which the Cortex-R4F CPU detects a single-bit  |
  |                          | error                                                                                   |
  |                          | param2 & param3 - RESERVED                                                              |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_DCC1_ERR           | param1[19-0] - Indicates the current value of Counter0                                  |
  |                          | param2[19-0] - Indicates the current value of Counter1                                  |
  |                          | param3 - RESERVED                                                                       |
  |                          | param1[19-0] - Indicates the current counter values might not be accurate               |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_EEPROM_CORRERR     | param1, param2 & param3 - RESERVED                                                      |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_EEPROM_UNCORRERR   | param1, param2 & param3 - RESERVED                                                      |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_PLL2_SLIP          | param1, param2 & param3 - RESERVED                                                      |
  |--------------------------|-----------------------------------------------------------------------------------------|
  | G1ERR_DCC2_ERR           | param1[19-0] - Indicates the current value of Counter0                                  |
  |                          | param2[19-0] - Indicates the current value of Counter1                                  |
  |                          | param3 - RESERVED                                                                       |
  |                          | param1[19-0] - Indicates the current counter values might not be accurate               |
  |--------------------------|-----------------------------------------------------------------------------------------|
  *
  */
  /*SAFETYMCUSW 298 S MR:- <APPROVED> Comment_1*/
typedef void (* ESM_Application_Callback) (uint32 grp_channel, uint32 param1, uint32 param2, uint32 param3);



/**
  * \enum       SL_ResetReason
  *
  * \brief      Enumerations for Reset Reason
  *
  */
typedef enum _SL_ResetReason {
    RESET_TYPE_UNKNOWN          = 0u,   /**< Reset reason is unknow */
    RESET_TYPE_POWERON          = 1u,   /**< nPORRST Reset or VMON Reset*/
    RESET_TYPE_OSC_FAILURE      = 2u,   /**< Reset due to Oscillator failure */
    RESET_TYPE_WATCHDOG         = 3u,   /**< Reset due to Watchdog expirty */
    RESET_TYPE_DEBUG            = 4u,   /**< Reset due to software(Debug) */
    RESET_TYPE_ICEPICK          = 5u,   /**< Reset by Ice Pick (JTAG) */
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    RESET_TYPE_CPU              = 6u,   /**< Reset due to CPU SelfTest Completion or toggling of SL_CPU_RESET bit */
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
    RESET_TYPE_CPU0             = 6u,
    RESET_TYPE_CPU1             = 10u,
#endif
    RESET_TYPE_SWRST            = 7u,   /**< Software Reset */
    RESET_TYPE_EXTRST           = 8u,   /**< nRST reset or Warm Reset */
    RESET_TYPE_EXTRST_NERROR    = 9u    /**< nRST due to nERROR */
}SL_ResetReason;

/**
  * \enum       SL_DCAN_Instance
  *
  * \brief      Enumerations for DCAN instances
  *
  */
typedef enum _SL_DCAN_Instance
{
    SL_DCAN1 = 1,
    SL_DCAN2,
    SL_DCAN3,
    SL_DCAN4
} SL_DCAN_Instance;

/**
  * \enum       SL_MIBSPI Interface
  *
  * \brief      Enumerations for MIBSPI instances
  *
  */
typedef enum _SL_MIBSPI_Instance
{
    SL_MIBSPI1 = 1,
    SL_MIBSPI2,
    SL_MIBSPI3,
    SL_MIBSPI4,
    SL_MIBSPI5
} SL_MIBSPI_Instance;


/**
  * \struct     SL_ResetReason_XInfo
  *
  * \brief      Provides extended information of the previous reset (using shadow registers)
  *
  */
typedef struct _SL_ResetReason_XInfo{
    boolean     nError;                 /**< TRUE when nError pin is active (low), else FALSE */
    uint32      esmGrp2Status;          /**< Each bit indicate the status of ESM Group2 channels */
    uint32      esmGrp3Status;          /**< Each bit indicate the status of ESM Group3 channels */
} SL_ResetReason_XInfo;



/**
  * \enum       SL_AutoInitRamId
  *
  * \brief      Enumerations for Auto Initializaiton memory API SL_Init_Memory
  *
  * \todo       Populate rest of the peripheral IDs
  */
typedef enum _SL_AutoInitRamId {
    RAMTYPE_RAM         = 0x00000001u,/**< Internal RAM*/

    RAMTYPE_DMA_RAM     = 0x00000002u,/**<DMA RAM*/

    RAMTYPE_VIM         = 0x00000004u,/**<VIM RAM*/

    RAMTYPE_NHET1       = 0x00000008u,/**<NHET1 RAM*/
    RAMTYPE_HET_TU1     = 0x00000010u/**<HTU RAM*/
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        ,
    RAMTYPE_NHET2       = 0x00008000u,/**<NHET2 RAM*/
    RAMTYPE_HET_TU2     = 0x00010000u,/**<HTU2 RAM*/

    RAMTYPE_DCAN1_RAM   = 0x00000020u,/**<DCAN1 RAM*/
    RAMTYPE_DCAN2_RAM   = 0x00000040u,/**<DCAN2 RAM*/
    RAMTYPE_DCAN3_RAM   = 0x00000400u,/**<DCAN3 RAM*/
    RAMTYPE_DCAN4_RAM   = 0x00100000u,/**<DCAN4 RAM*/

    RAMTYPE_MIBSPI1_RAM = 0x00000080u,/**<MibSPI1 RAM*/
    RAMTYPE_MIBSPI2_RAM = 0x00040000u,/**<MibSPI2 RAM*/
    RAMTYPE_MIBSPI3_RAM = 0x00000800u,/**<MibSPI3 RAM*/
    RAMTYPE_MIBSPI4_RAM = 0x00080000u,/**<MibSPI4 RAM*/
    RAMTYPE_MIBSPI5_RAM = 0x00001000u,/**<MibSPI5 RAM*/

    RAMTYPE_MIBADC1_RAM = 0x00000100u,/**<MibADC1 RAM*/
    RAMTYPE_MIBADC2_RAM = 0x00004000u/**<MibADC2 RAM*/
#endif
#if defined(_TMS570LC43x_) 
        ,
    RAMTYPE_FTU_RAM     = 0x00002000u/**<MibADC2 RAM*/
#endif
} SL_AutoInitRamId;


#if defined(_TMS570LC43x_) 
#define   ALL_RAMTYPE_IDS       (uint32)(RAMTYPE_RAM    |   \
                                 RAMTYPE_DMA_RAM        |   \
                                 RAMTYPE_VIM            |   \
                                 RAMTYPE_NHET1          |   \
                                 RAMTYPE_NHET2          |   \
                                 RAMTYPE_HET_TU1        |   \
                                 RAMTYPE_HET_TU2        |   \
                                 RAMTYPE_DCAN1_RAM      |   \
                                 RAMTYPE_DCAN2_RAM      |   \
                                 RAMTYPE_DCAN3_RAM      |   \
                                 RAMTYPE_DCAN4_RAM      |   \
                                 RAMTYPE_MIBADC1_RAM    |   \
                                 RAMTYPE_MIBADC2_RAM    |   \
                                 RAMTYPE_MIBSPI1_RAM    |   \
                                 RAMTYPE_MIBSPI2_RAM    |   \
                                 RAMTYPE_MIBSPI3_RAM    |   \
                                 RAMTYPE_MIBSPI4_RAM    |   \
                                 RAMTYPE_MIBSPI5_RAM    |   \
                                 RAMTYPE_FTU_RAM) 
#endif
#if defined(_RM57Lx_)
#define   ALL_RAMTYPE_IDS       (uint32)(RAMTYPE_RAM    |   \
                                 RAMTYPE_DMA_RAM        |   \
                                 RAMTYPE_VIM            |   \
                                 RAMTYPE_NHET1          |   \
                                 RAMTYPE_NHET2          |   \
                                 RAMTYPE_HET_TU1        |   \
                                 RAMTYPE_HET_TU2        |   \
                                 RAMTYPE_DCAN1_RAM      |   \
                                 RAMTYPE_DCAN2_RAM      |   \
                                 RAMTYPE_DCAN3_RAM      |   \
                                 RAMTYPE_DCAN4_RAM      |   \
                                 RAMTYPE_MIBADC1_RAM    |   \
                                 RAMTYPE_MIBADC2_RAM    |   \
                                 RAMTYPE_MIBSPI1_RAM    |   \
                                 RAMTYPE_MIBSPI2_RAM    |   \
                                 RAMTYPE_MIBSPI3_RAM    |   \
                                 RAMTYPE_MIBSPI4_RAM    |   \
                                 RAMTYPE_MIBSPI5_RAM) 
#endif

/**
  * \enum       SL_SelfTestType
  *
  * \brief      Self test types for use with SL_SelfTest_xxxx APIs
  *
  * \todo       Will be populated as per the function implementaitons
  */
typedef enum _SL_SelfTest_Type {
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    SRAM_ECC_ERROR_FORCING_1BIT = 0xA0,            /**< BTCM SRAM 1-Bit ECC Error forcing tests(to be used with API @ref SL_SelfTest_SRAM)        */
    SRAM_ECC_1BIT_FAULT_INJECTION,                /**< BTCM SRAM 1-Bit ECC Fault injection(to be used with API @ref SL_SelfTest_SRAM)            */
    SRAM_ECC_ERROR_FORCING_2BIT,                /**< BTCM SRAM 2-Bit ECC Error forcing test(to be used with API @ref SL_SelfTest_SRAM)            */
    SRAM_ECC_2BIT_FAULT_INJECT,                    /**< BTCM SRAM 2-Bit ECC Error fault inject    (to be used with API @ref SL_SelfTest_SRAM)        */
    SRAM_PAR_ADDR_CTRL_SELF_TEST,                /**< BTCM SRAM Address & Control Parity self test(to be used with API @ref SL_SelfTest_SRAM)    */
    SRAM_ECC_ERROR_PROFILING,                    /**< SRAM Single bit Error Profiling test(to be used with API @ref SL_SelfTest_SRAM)            */
    SRAM_ECC_ERROR_PROFILING_FAULT_INJECT,        /**< SRAM Single bit Error Profiling fault injection(to be used with API @ref SL_SelfTest_SRAM)*/
    SRAM_RADECODE_DIAGNOSTICS,                    /**< SRAM Redundant Address Decode self test(to be used with API @ref SL_SelfTest_SRAM)        */

    FEE_ECC_DATA_CORR_MODE,                        /**< ECC Data correction diagnostic mode.(to be used with API @ref SL_SelfTest_FEE)*/
    FEE_ECC_SYN_REPORT_MODE,                    /**< ECC Syndrome reporting diagnostic mode(to be used with API @ref SL_SelfTest_FEE) */
    FEE_ECC_MALFUNCTION_MODE1,                    /**< ECC Malfunction test mode 1 (same data mode)(to be used with API @ref SL_SelfTest_FEE)*/
    FEE_ECC_MALFUNCTION_MODE2,                    /**< ECC malfunction test mode 2 (inverted data mode)(to be used with API @ref SL_SelfTest_FEE) */
    FEE_ECC_ADDR_TAG_REG_MODE,                    /**< Address tag register diagnostic mode(to be used with API @ref SL_SelfTest_FEE) */
    FEE_ECC_TEST_MODE_1BIT,                        /**< 1Bit ECC Data correction diagnostic mode(to be used with API @ref SL_SelfTest_FEE) */
    FEE_ECC_TEST_MODE_1BIT_FAULT_INJECT,        /**< Address tag register diagnostic mode(to be used with API @ref SL_SelfTest_FEE) */
    FEE_ECC_TEST_MODE_2BIT,                        /**< 2Bit ECC Data correction diagnostic mode.Verifies whether the 2 bit ecc error is getting created in FEE properly*/
    FEE_ECC_TEST_MODE_2BIT_FAULT_INJECT,        /**< 2Bit ECC Fault inject creates a 2 bit ecc error and leaves the application to handle the scenario */

    FLASH_ECC_ADDR_TAG_REG_MODE,                /**< Address tag register diagnostic mode(to be used with API @ref SL_SelfTest_Flash) */
    /*FLASH_ECC_PIPELINE_BUF_PAR_MODE,            < Pipeline buffer parity diagnostic mode <NOT IMPLEMENTED IN THIS RELEASE> */
    FLASH_ADDRESS_ECC_SELF_TEST,                /**< Flash wrapper address ecc self test verifies whether the address ecc is working fine (to be used with API @ref SL_SelfTest_Flash)*/
    FLASH_ADDRESS_ECC_FAULT_INJECT,                /**< Flash wrapper address ecc self test fault inject creaters an address ecc error and leaves it for the application to handle it(to be used with API @ref SL_SelfTest_Flash)*/
    FLASH_ADDRESS_PARITY_SELF_TEST,             /**< Flash wrapper address parity self test.Verifies whether teh address parity feature is working fine*/
    FLASH_ADDRESS_PARITY_FAULT_INJECT,          /**< Flash wrapper address parity self test fault inject creates an address parity error and leaves it for the application to handle it(to be used with API @ref SL_SelfTest_Flash)*/
    FLASH_ECC_TEST_MODE_1BIT,                   /**< 1Bit ECC Data correction diagnostic mode(to be used with API @ref SL_SelfTest_Flash) */
    FLASH_ECC_TEST_MODE_2BIT,                    /**< 2Bit ECC Data correction diagnostic mode(to be used with API @ref SL_SelfTest_Flash) */
    FLASH_HARD_ERROR_LIVELOCK,
    FLASH_ECC_TEST_MODE_2BIT_FAULT_INJECT,         /**< 2Bit ECC fault injection mode. No response handled. NOTE: Application must read from 0x20000000 to generate error(to be used with API @ref SL_SelfTest_Flash) */

