pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/include/sl_types.h
    PBIST_EXECUTE,                                 /**< PBIST self test mode .The RAM info register RINFOL and RINFOU are used to select the memories for test(to be used with API @ref SL_SelfTest_PBIST)*/
    PBIST_EXECUTE_OVERRIDE,                        /**< PBIST test mode with ROM override.The memory information available from ROM will override the RAM selection from RAM info Registers (to be used with API @ref SL_SelfTest_PBIST)*/

    STC_RUN,                                       /**< CCMR4 test using STC(to be used with API @ref SL_SelfTest_STC) */
    STC_COMPARE_SELFCHECK,                         /**< STC self check diagnostic(to be used with API @ref SL_SelfTest_STC) */

    PSCON_SELF_TEST,                               /**< PSCON self test using Compare match & mismatch tests (to be used with API @ref SL_SelfTest_PSCON)*/
    PSCON_ERROR_FORCING,                           /**< PSCON Error-Forcing self test mode (to be used with API @ref SL_SelfTest_PSCON)*/
    PSCON_ERROR_FORCING_FAULT_INJECT,               /**< PSCON Error-Forcing fault inject(to be used with API @ref SL_SelfTest_PSCON) */
    PSCON_SELF_TEST_ERROR_FORCING,                /**< PSCON Self-Test Error forcing mode (to be used with API @ref SL_SelfTest_PSCON)*/
    PSCON_SELF_TEST_ERROR_FORCING_FAULT_INJECT,    /**< PSCON Self-Test Error forcing fault inject(to be used with API @ref SL_SelfTest_PSCON) */
    PSCON_PMA_TEST,                                /**< PSCON Privilege Mode access test - MUST BE RUN IN USER MODE (to be used with API @ref SL_SelfTest_PSCON)*/

    EFUSE_SELF_TEST_AUTOLOAD,                      /**< EFuse Auto load self test (to be used with API @ref SL_SelfTest_EFuse)*/
    EFUSE_SELF_TEST_ECC,                           /**< EFuse ECC Self test (to be used with API @ref SL_SelfTest_EFuse)*/
    EFUSE_SELF_TEST_STUCK_AT_ZERO,                 /**< EFuse stuck-at-zero self test (to be used with API @ref SL_SelfTest_EFuse)*/
    CCMR4F_SELF_TEST,                              /**< CCMR4F Self-test (to be used with API @ref SL_SelfTest_CCMR4F)*/
    CCMR4F_ERROR_FORCING_TEST,                    /**< CCMR4F Error forcing test(to be used with API @ref SL_SelfTest_CCMR4F) */
    CCMR4F_ERROR_FORCING_TEST_FAULT_INJECT,        /**< CCMR4F Error focing test, but does not clear the nERROR & ESM Interrupt (Callee function must clear these) (to be used with API @ref SL_SelfTest_CCMR4F)*/
    CCMR4F_SELF_TEST_ERROR_FORCING,               /**< CCMR4F Self-test error forcing (to be used with API @ref SL_SelfTest_CCMR4F)*/
    L2INTERCONNECT_FAULT_INJECT,                  /** L2 interconnect  fault injection to create error trap (to be used with API @ref SL_SelfTestL2L3Interconnect)*/
    L3INTERCONNECT_FAULT_INJECT                  /** L3 interconnect  fault injection to create error trap(to be used with API @ref SL_SelfTestL2L3Interconnect)*/
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
    SRAM_ECC_ERROR_FORCING_1BIT = 0xA0A0,   /**< L2RAMW SECDED 1-Bit ECC Error
                                              forcing tests(to be used with API
                                              @ref SL_SelfTest_SRAM)
                                             */
    SRAM_ECC_ERROR_FORCING_2BIT,            /**< L2RAMW SECDED 2-Bit ECC Error
                                              forcing test(to be used with API
                                              @ref SL_SelfTest_SRAM)
                                             */

    FLASH_ECC_TEST_MODE_1BIT,               /**< Test of the CPU SECDED for 1
                                              bit ECC Error on read from L2FMC
                                              (to be used with API @ref
                                              SL_SelfTest_Flash) */
    FLASH_ECC_TEST_MODE_2BIT,               /**< Test of the CPU SECDED for 2
                                              bit ECC Error on read from L2FMC
                                              (to be used with API @ref
                                              SL_SelfTest_Flash) */

    PBIST_EXECUTE,                          /**< PBIST self test mode .The RAM
                                              info register RINFOL and RINFOU
                                              are used to select the memories
                                              for test(to be used with API @ref
                                              SL_SelfTest_PBIST)*/
    PBIST_EXECUTE_OVERRIDE,                 /**< PBIST test mode with ROM
                                              override.The memory information
                                              available from ROM will override
                                              the RAM selection from RAM info
                                              Registers (to be used with API
                                              @ref SL_SelfTest_PBIST)*/

    EFUSE_SELF_TEST_AUTOLOAD,               /**< EFuse Auto load self test (to
                                              be used with API @ref
                                              SL_SelfTest_EFuse)*/
    EFUSE_SELF_TEST_ECC,                    /**< EFuse ECC Self test (to be used
                                              with API @ref SL_SelfTest_EFuse)*/
    EFUSE_SELF_TEST_STUCK_AT_ZERO,          /**< EFuse stuck-at-zero self test
                                              (to be used with API @ref
                                              SL_SelfTest_EFuse)*/

    CCMR5F_CPUCOMP_SELF_TEST,                /**< CCMR5F CPU Comparator Self-test (to be used
                                              with API @ref
                                              SL_SelfTest_CCMR5F)*/
    CCMR5F_CPUCOMP_ERROR_FORCING_TEST,     /**< CCMR5F CPU Compare Error forcing test(to be
                                              used with API @ref
                                              SL_SelfTest_CCMR5F) */
    CCMR5F_CPUCOMP_ERROR_FORCING_TEST_FAULT_INJECT, /**< CCMR5F CPU Compare Error Fault injection , but
                                              does not clear the nERROR & ESM
                                              Interrupt (Callee function must
                                              clear these) (to be used with API
                                              @ref SL_SelfTest_CCMR5F)*/
    CCMR5F_CPUCOMP_SELF_TEST_ERROR_FORCING, /**< CCMR5F CPU Comparator Self-test error forcing
                                              (to be used with API @ref
                                              SL_SelfTest_CCMR5F)*/
    CCMR5F_VIMCOMP_SELF_TEST,               /**< CCMR5F VIM Comparator Self-test (to be used
                                              with API @ref
                                              SL_SelfTest_CCMR5F)*/
    CCMR5F_VIMCOMP_ERROR_FORCING_TEST,      /**< CCMR5F VIM Compare Error forcing test(to be
                                              used with API @ref
                                              SL_SelfTest_CCMR5F) */
    CCMR5F_VIMCOMP_ERROR_FORCING_TEST_FAULT_INJECT, /**< CCMR5F VIM Compare Error focing test, but
                                              does not clear the nERROR & ESM
                                              Interrupt (Callee function must
                                              clear these) (to be used with API
                                              @ref SL_SelfTest_CCMR5F)*/
    CCMR5F_VIMCOMP_SELF_TEST_ERROR_FORCING, /**< CCMR5F VIM Comparator Self-test error forcing
                                              (to be used with API @ref
                                              SL_SelfTest_CCMR5F)*/
    CCMR5F_PDCOMP_SELF_TEST,                /**< CCMR5F Power Domain Comparator Self-test (to be used
                                              with API @ref
                                              SL_SelfTest_CCMR5F)*/
    CCMR5F_PDCOMP_ERROR_FORCING_TEST,       /**< CCMR5F Power Domain Compare Error forcing test(to be
                                              used with API @ref
                                              SL_SelfTest_CCMR5F) */
    CCMR5F_PDCOMP_ERROR_FORCING_TEST_FAULT_INJECT, /**< CCMR5F Power Domain
                                                     Compare Error focing test, but
                                              does not clear the nERROR & ESM
                                              Interrupt (Callee function must
                                              clear these) (to be used with API
                                              @ref SL_SelfTest_CCMR5F)*/
    CCMR5F_PDCOMP_SELF_TEST_ERROR_FORCING,  /**< CCMR5F Power Domain Comparator Self-test error forcing
                                              (to be used with API @ref
                                              SL_SelfTest_CCMR5F)*/
    CCMR5F_INMCOMP_SELF_TEST,               /**< CCMR5F Inactive CPU Monitor
                                              Comparator Self-test (to be used
                                              with API @ref
                                              SL_SelfTest_CCMR5F)*/
    CCMR5F_INMCOMP_ERROR_FORCING_TEST,      /**< CCMR5F Inactive CPU Monitor
                                              Compare Error forcing test(to be
                                              used with API @ref
                                              SL_SelfTest_CCMR5F) */
    CCMR5F_INMCOMP_ERROR_FORCING_TEST_FAULT_INJECT, /**< CCMR5F Inactive CPU
                                                      Monitor Compare Error focing test, but
                                              does not clear the nERROR & ESM
                                              Interrupt (Callee function must
                                              clear these) (to be used with API
                                              @ref SL_SelfTest_CCMR5F)*/
    CCMR5F_INMCOMP_SELF_TEST_ERROR_FORCING, /**< CCMR5F Inactive CPU Monitor
                                              Comparator Self-test error forcing
                                              (to be used with API @ref
                                              SL_SelfTest_CCMR5F)*/

    STC1_RUN,                               /**< CPU test using STC1(to be used
                                              with API @ref SL_SelfTest_STC) */
    STC1_COMPARE_SELFCHECK,                 /**< STC1 self check diagnostic(to be
                                              used with API @ref
                                              SL_SelfTest_STC) */
    STC2_RUN,                               /**< */
    STC2_COMPARE_SELFCHECK,                 /**< */

    DMA_ECC_TEST_MODE_1BIT,                 /**< DMA RAM SECDED 1-Bit ECC Error
                                              forcing tests(to be used with API
                                              @ref SL_SelfTest_DMA)
                                             */

    DMA_ECC_TEST_MODE_2BIT,                 /**< DMA RAM SECDED 2-Bit ECC Error
                                              forcing tests(to be used with API
                                              @ref SL_SelfTest_DMA)
                                             */
    DMA_ECC_TEST_MODE_1BIT_FAULT_INJECT,    /**< DMA RAM SECDED 1-Bit ECC Error
                                              Fault injection(to be used with API
                                              @ref SL_SelfTest_DMA)
                                             */
    DMA_ECC_TEST_MODE_2BIT_FAULT_INJECT,     /**< DMA RAM SECDED 2-Bit ECC Error
                                              Fault injection(to be used with API
                                              @ref SL_SelfTest_DMA)
                                             */

