pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/include/sl_types.h
    CAN_ECC_TEST_MODE_1BIT,                  /**< CAN RAM SECDED 1-Bit ECC Error
                                              forcing tests(to be used with API
                                              @ref SL_SelfTest_CAN)
                                             */
    CAN_ECC_TEST_MODE_2BIT,                  /**< CAN RAM SECDED 2-Bit ECC Error
                                              forcing tests(to be used with API
                                              @ref SL_SelfTest_CAN)
                                             */
    CAN_ECC_TEST_MODE_1BIT_FAULT_INJECT,     /**< CAN RAM SECDED 1-Bit ECC Error
                                              Fault injection (to be used with API
                                              @ref SL_SelfTest_CAN)
                                             */
    CAN_ECC_TEST_MODE_2BIT_FAULT_INJECT,     /**< CAN RAM SECDED 2-Bit ECC Error
                                              Fault injection (to be used with API
                                              @ref SL_SelfTest_CAN)
                                             */
    
    MIBSPI_ECC_TEST_MODE_1BIT,               /**< MibSPI RAM SECDED 1-Bit ECC Error
                                              forcing tests (to be used with API
                                              @ref SL_SelfTest_MibSPI)
                                             */
    MIBSPI_ECC_TEST_MODE_2BIT,               /**< MibSPI RAM SECDED 2-Bit ECC Error
                                              forcing tests (to be used with API
                                              @ref SL_SelfTest_MibSPI)
                                             */
    MIBSPI_ECC_TEST_MODE_1BIT_FAULT_INJECT,  /**< MibSPI RAM SECDED 1-Bit ECC Error
                                              Fault injection(to be used with API
                                              @ref SL_SelfTest_MibSPI)
                                             */
    MIBSPI_ECC_TEST_MODE_2BIT_FAULT_INJECT   /**< MibSPI RAM SECDED 2-Bit ECC Error
                                              Fault injection (to be used with API
                                              @ref SL_SelfTest_MibSPI)
                                             */
#endif

} SL_SelfTestType;

/** \defgroup grp_testype_range SRAM Range defines
 *  Following macros are used to define the range of TCM RAM
 *
 */
/**@{*/
/*SAFETYMCUSW 79 S MR:19.4 <APPROVED> Comment_2*/
#define TESTTYPE_MIN          SRAM_ECC_ERROR_FORCING_1BIT     /**< starting testtype */
/*SAFETYMCUSW 79 S MR:19.4 <APPROVED> "Reason -  Reviewed and the value assigned is an enumeration"*/
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
#define TESTTYPE_MAX          L3INTERCONNECT_FAULT_INJECT     /**< ending testtype */
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
#define TESTTYPE_MAX          MIBSPI_ECC_TEST_MODE_2BIT          /**< ending testtype */
#endif
/**@}*/

/**
  * \enum     SL_SelfTest_Result
  *
  * \brief    Enumberation to indicate the status of a self test
  */
typedef enum _SL_SelfTest_Result {
    ST_FAIL   = 0xAB,
    ST_PASS   = 0xCD
} SL_SelfTest_Result;


/** \defgroup PBIST_RAMGroup Macros for PBIST RAM groups
 *
 *  Enumerations for selecting the RAM Groups parameters for SL_SelfTest_PBIST API
 *  Naming Convention: PBIST_RAMGROUP_<RAM Group Select#>_<Peripheral Abbreviation>
 *
 *  Note : For details on RAM Group, Algorithm Mapping and supported types refer to device TRM
 */
/**@{*/
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
#define PBIST_RAMGROUP_01_PBIST_ROM  (uint32)0x00000001u  /**< PBIST ROM                  */
#define PBIST_RAMGROUP_02_STC_ROM    (uint32)0x00000002u  /**< STC ROM                    */
#define PBIST_RAMGROUP_03_DCAN1      (uint32)0x00000004u  /**< DCAN1 2 Port RAM           */
#define PBIST_RAMGROUP_04_DCAN2      (uint32)0x00000008u  /**< DCAN2 2 Port RAM           */
#define PBIST_RAMGROUP_05_DCAN3      (uint32)0x00000010u  /**< DCA3 2 Port RAM            */
#define PBIST_RAMGROUP_06_ESRAM1     (uint32)0x00000020u  /**< ESRAM1 Single Port RAM     */
#define PBIST_RAMGROUP_07_MIBSPI1    (uint32)0x00000040u  /**< MIBSPI1 2 Port RAM         */
#define PBIST_RAMGROUP_08_MIBSPI3    (uint32)0x00000080u  /**< MIBSPI3 2 Port RAM         */
#define PBIST_RAMGROUP_09_MIBSPI5    (uint32)0x00000100u  /**< MIBSPI5 2 Port RAM         */
#define PBIST_RAMGROUP_10_VIM        (uint32)0x00000200u  /**< VIM 2 Port RAM             */
#define PBIST_RAMGROUP_11_MIBADC1    (uint32)0x00000400u  /**< MIBADC1 Port RAM           */
#define PBIST_RAMGROUP_12_DMA        (uint32)0x00000800u  /**< DMA Port RAM               */
#define PBIST_RAMGROUP_13_N2HET1     (uint32)0x00001000u  /**< N2HET1 2 Port RAM          */
#define PBIST_RAMGROUP_14_HETTU1     (uint32)0x00002000u  /**< HETTU1 2 Port RAM          */
#define PBIST_RAMGROUP_15_RTP        (uint32)0x00004000u  /**< RTP 2 Port RAM             */
#define PBIST_RAMGROUP_16_FRAY       (uint32)0x00008000u  /**< FlexRay 2 Port RAM         */
#define PBIST_RAMGROUP_17_FRAY       (uint32)0x00010000u  /**< FlexRay 1 Port RAM         */
#define PBIST_RAMGROUP_18_MIBADC2    (uint32)0x00020000u  /**< MIBAD2 2 Port RAM          */
#define PBIST_RAMGROUP_19_N2HET2     (uint32)0x00040000u  /**< N2HET2 2 Port RAM          */
#define PBIST_RAMGROUP_20_HETTU2     (uint32)0x00080000u  /**< HETTU2 2 Port RAM          */
#define PBIST_RAMGROUP_21_ESRAM5     (uint32)0x00100000u  /**< ESRAM5 Single Port RAM     */
#define PBIST_RAMGROUP_22_ESRAM6     (uint32)0x00200000u  /**< ESRAM6 Single Port RAM     */
#define PBIST_RAMGROUP_23_ETHERNET1  (uint32)0x00400000u  /**< Ethernet 2 Port RAM        */
#define PBIST_RAMGROUP_24_ETHERNET2  (uint32)0x00800000u  /**< Ethernet 2 Port RAM        */
#define PBIST_RAMGROUP_25_ETHERNET3  (uint32)0x01000000u  /**< Ethernet 1 Port RAM        */
#define PBIST_RAMGROUP_26_USB1       (uint32)0x02000000u  /**< USB 2 Port RAM             */
#define PBIST_RAMGROUP_27_USB2       (uint32)0x04000000u  /**< USB 1 Port RAM             */
#define PBIST_RAMGROUP_28_ESRAM8     (uint32)0x08000000u  /**< ESRAM8 Single Port RAM     */
#define PBIST_RAMGROUP_29_RSVD       (uint32)0x10000000u  /**< --- Reserved               */
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
#define PBIST_RAMGROUP_01_PBIST_ROM                (uint64)0x0000000001u /**<  */
#define    PBIST_RAMGROUP_02_STC1_1_ROM_R5            (uint64)0x0000000002u /**<  */
#define    PBIST_RAMGROUP_03_STC1_2_ROM_R5            (uint64)0x0000000004u /**<  */
#define    PBIST_RAMGROUP_04_STC2_ROM_NHET            (uint64)0x0000000008u /**<  */
#define    PBIST_RAMGROUP_05_AWM1                    (uint64)0x0000000010u /**<  */
#define    PBIST_RAMGROUP_06_DCAN1                    (uint64)0x0000000020u /**<  */
#define    PBIST_RAMGROUP_07_DCAN2                    (uint64)0x0000000040u /**<  */
#define    PBIST_RAMGROUP_08_DMA                    (uint64)0x0000000080u /**<  */
#define    PBIST_RAMGROUP_09_HTU1                    (uint64)0x0000000100u /**<  */
#define    PBIST_RAMGROUP_10_MIBSPI1                (uint64)0x0000000200u /**<  */
#define    PBIST_RAMGROUP_11_MIBSPI2                (uint64)0x0000000400u /**<  */
#define    PBIST_RAMGROUP_12_MIBSPI3                (uint64)0x0000000800u /**<  */
#define    PBIST_RAMGROUP_13_NHET1                    (uint64)0x0000001000u /**<  */
#define    PBIST_RAMGROUP_14_VIM                    (uint64)0x0000002000u /**<  */
#define    PBIST_RAMGROUP_15_RSVD                    (uint64)0x0000004000u /**<  */
#define    PBIST_RAMGROUP_16_RTP                    (uint64)0x0000008000u /**<  */
#define    PBIST_RAMGROUP_17_ATB                    (uint64)0x0000010000u /**<  */
#define    PBIST_RAMGROUP_18_AWM2                    (uint64)0x0000020000u /**<  */
#define    PBIST_RAMGROUP_19_DCAN3                    (uint64)0x0000040000u /**<  */
#define    PBIST_RAMGROUP_20_DCAN4                    (uint64)0x0000080000u /**<  */
#define    PBIST_RAMGROUP_21_HTU2                    (uint64)0x0000100000u /**<  */
#define    PBIST_RAMGROUP_22_MIBSPI4                (uint64)0x0000200000u /**<  */
#define    PBIST_RAMGROUP_23_MIBSPI5                (uint64)0x0000400000u /**<  */
#define    PBIST_RAMGROUP_24_NHET2                    (uint64)0x0000800000u /**<  */
#define    PBIST_RAMGROUP_25_FTU                    (uint64)0x0001000000u /**<  */
#define    PBIST_RAMGROUP_26_FRAY_INBUF_OUTBUF        (uint64)0x0002000000u /**<  */
#define    PBIST_RAMGROUP_27_CPGMAC_STATE_RXADDR    (uint64)0x0004000000u /**<  */
#define    PBIST_RAMGROUP_28_CPGMAC_STAT_FIFO        (uint64)0x0008000000u /**<  */
#define    PBIST_RAMGROUP_29_L2RAMW                (uint64)0x0010000000u /**<  */
#define    PBIST_RAMGROUP_30_L2RAMW                (uint64)0x0020000000u /**<  */
#define    PBIST_RAMGROUP_31_R5_ICACHE                (uint64)0x0040000000u /**<  */
#define    PBIST_RAMGROUP_32_R5DCACHE                (uint64)0x0080000000u /**<  */
#define    PBIST_RAMGROUP_33_RSVD                    (uint64)0x0100000000u /**<  */
#define    PBIST_RAMGROUP_34_RSVD                    (uint64)0x0200000000u /**<  */
#define    PBIST_RAMGROUP_35_FRAY_TRBUF_MSGRAM        (uint64)0x0400000000u /**<  */
#define    PBIST_RAMGROUP_36_CPGMAC_CPPI            (uint64)0x0800000000u /**<  */
#define    PBIST_RAMGROUP_37_R5_DCACHE_DIRTY        (uint64)0x1000000000u /**<  */
#define    PBIST_RAMGROUP_38_RSVD                    (uint64)0x2000000000u /**<  */
#endif
/**@}*/



/** \defgroup PBIST_Algorithm Macros for PBIST Algorithms
 *
 *  Enumerations for selecting the PBIST algorith for SL_SelfTest_PBIST API
 *  Naming Convention: PBISTALGO_<Algo name>_<1/2>PORT
 *
 *  For details on Algorithms, Algorithm Mapping and supported types refer to device TRM
 *
 */
/**@{*/
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
#define PBISTALGO_TRIPLE_READ_SLOW_READ      (uint32)0x00000001u  /**<TRIPLE_READ_SLOW_READ  for PBIST and STC ROM*/
#define PBISTALGO_TRIPLE_READ_FAST_READ      (uint32)0x00000002u  /**<TRIPLE_READ_SLOW_READ  for PBIST and STC ROM*/
#define PBISTALGO_MARCH13N_RED_2PORT         (uint32)0x00000004u  /**< March13 N Algo for 2 Port mem --- BASELINE TEST ALGO with HIGHEST OVERALL COVERAGE */
#define PBISTALGO_MARCH13N_RED_1PORT         (uint32)0x00000008u  /**< March13 N Algo for 1 Port mem --- BASELINE TEST ALGO with HIGHEST OVERALL COVERAGE */
#define PBISTALGO_DOWN1A_RED_2PORT           (uint32)0x00000010u  /**< Down1a Algor forces the switching fo all data bits & most addr bits on consecutive read cycles */
#define PBISTALGO_DOWN1A_RED_1PORT           (uint32)0x00000020u  /**< Down1a Algor forces the switching fo all data bits & most addr bits on consecutive read cycles */
#define PBISTALGO_MAPCOLUMN_2PORT            (uint32)0x00000040u  /**< Map Column algo (to identify bit line senstivities) for 2 Port memory */
#define PBISTALGO_MAPCOLUMN_1PORT            (uint32)0x00000080u  /**< Map Column algo (to identify bit line senstivities) for 1 Port memory */
#define PBISTALGO_PRECHARGE_2PORT            (uint32)0x00000100u  /**< Pre-Charge algo to exercise pre-charge capability for 2 port memory */
#define PBISTALGO_PRECHARGE_1PORT            (uint32)0x00000200u  /**< Pre-Charge algo to exercise pre-charge capability for 1 port memory */
#define PBISTALGO_DTXN2_2PORT                (uint32)0x00000400u  /**< Global column decode logic algo for 2 Port memories*/
#define PBISTALGO_DTXN2_1PORT                (uint32)0x00000800u  /**< Global column decode logic algo for 1 Port memories*/
#define PBISTALGO_PMOS_OPEN_2PORT            (uint32)0x00001000u  /**<pmos oper algo for 2 port memories*/
#define PBISTALGO_PMOS_OPEN_1PORT            (uint32)0x00002000u  /**<pmos oper algo for 1 port memories*/
#define PBISTALGO_PMOS_OP_SLICE1_2PORT       (uint32)0x00004000u  /**<pmos open slice1 for 2port memories*/
#define PBISTALGO_PMOS_OP_SLICE2_2PORT       (uint32)0x00008000u  /**<pmos open slice2 for 2port memories*/
#define PBISTALGO_FLIP10_2PORT               (uint32)0x00010000u  /**<flip10 algo for 2 port memories*/
#define PBISTALGO_FLIP10_1PORT               (uint32)0x00020000u  /**<flip10  algo for 1 port memories*/
#define PBISTALGO_IDDQ_2PORT                 (uint32)0x00040000u  /**<iddq  algo for 2 port memories*/
#define PBISTALGO_IDDQ_1PORT                 (uint32)0x00080000u  /**<iddq  algo for 1 port memories*/
#define PBISTALGO_RETENTION_2PORT            (uint32)0x00100000u  /**<retention  algo for 2 port memories*/
#define PBISTALGO_RETENTION_1PORT            (uint32)0x00200000u  /**<retention  algo for 1 port memories*/
#define PBISTALGO_IDDQ2_2PORT                (uint32)0x00400000u  /**<iddq2  algo for 2 port memories*/
#define PBISTALGO_IDDQ2_1PORT                (uint32)0x00800000u  /**<iddq2  algo for 1 port memories*/
#define PBISTALGO_RETENTION2_2PORT           (uint32)0x01000000u  /**<retention2  algo for 2 port memories*/
#define PBISTALGO_RETENTION2_1PORT           (uint32)0x02000000u  /**<retention2  algo for 1 port memories*/
#define PBISTALGO_IDDQROWSTRIPE_2PORT        (uint32)0x04000000u  /**<iddqwstripe  algo for 2 port memories*/
#define PBISTALGO_IDDQROWSTRIPE_1PORT        (uint32)0x08000000u  /**<iddqwstripe  algo for 1 port memories*/
#define PBISTALGO_IDDQROWSTRIPE2_2PORT       (uint32)0x10000000u  /**<iddqwstripe2  algo for 2 port memories*/
#define PBISTALGO_IDDQROWSTRIPE2_1PORT       (uint32)0x20000000u  /**<iddqwstripe2  algo for 1 port memories*/
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
#define PBISTALGO_TRIPLE_READ_SLOW_READ      (uint32)0x00000001u  /**<TRIPLE_READ_SLOW_READ  for PBIST and STC ROM*/
#define PBISTALGO_TRIPLE_READ_FAST_READ      (uint32)0x00000002u  /**<TRIPLE_READ_SLOW_READ  for PBIST and STC ROM*/
#define PBISTALGO_MARCH13N_2PORT             (uint32)0x00000004u  /**< March13 N Algo for 2 Port mem --- BASELINE TEST ALGO with HIGHEST OVERALL COVERAGE */
#define PBISTALGO_MARCH13N_1PORT             (uint32)0x00000008u  /**< March13 N Algo for 1 Port mem --- BASELINE TEST ALGO with HIGHEST OVERALL COVERAGE */
#define PBISTALGO_DOWN2_1PORT                (uint32)0x00000010u  /**<  */
#define PBISTALGO_DOWN2_2PORT                (uint32)0x00000020u  /**<  */
#define PBISTALGO_MARCH_DIS_INC_1PORT        (uint32)0x00000040u  /**<  */
#define PBISTALGO_MARCH_DIS_INC_2PORT        (uint32)0x00000080u  /**<  */
#define PBISTALGO_MARCH_DIS_DEC_1PORT        (uint32)0x00000100u  /**<  */
#define PBISTALGO_MARCH_DIS_DEC_2PORT        (uint32)0x00000200u  /**<  */
#define PBISTALGO_MARCH_DIS_INC_1PORT_1      (uint32)0x00000400u  /**<  */
#define PBISTALGO_MARCH_DIS_INC_2PORT_1      (uint32)0x00000800u  /**<  */
#define PBISTALGO_MARCH_DIS_DEC_1PORT_1      (uint32)0x00001000u  /**<  */
#define PBISTALGO_MARCH_DIS_DEC_2PORT_1      (uint32)0x00002000u  /**<  */
#define PBISTALGO_MAP_COLUMN_1PORT           (uint32)0x00004000u  /**< Map Column algo (to identify bit line senstivities) for 1 Port memory */
#define PBISTALGO_MAP_COLUMN_2PORT           (uint32)0x00008000u  /**< Map Column algo (to identify bit line senstivities) for 2 Port memory */
#define PBISTALGO_PRECHARGE_1PORT            (uint32)0x00010000u  /**< Pre-Charge algo to exercise pre-charge capability for 1 port memory */
#define PBISTALGO_PRECHARGE_2PORT            (uint32)0x00020000u  /**< Pre-Charge algo to exercise pre-charge capability for 2 port memory */
#define PBISTALGO_FLIP10_1PORT               (uint32)0x00040000u  /**<  */
#define PBISTALGO_FLIP10_2PORT               (uint32)0x00080000u  /**<  */
#define PBISTALGO_DTXN2_1PORT                (uint32)0x00100000u  /**< Global column decode logic algo for 1 Port memories*/
#define PBISTALGO_DTXN2_2PORT                (uint32)0x00200000u  /**< Global column decode logic algo for 2 Port memories*/
#define PBISTALGO_PMOS_OP_SLICE1_1PORT       (uint32)0x00400000u  /**<pmos open slice1 for 1port memories*/
#define PBISTALGO_PMOS_OP_SLICE1_2PORT       (uint32)0x00800000u  /**<pmos open slice1 for 2port memories*/
#define PBISTALGO_PMOS_OP_SLICE2_2PORT       (uint32)0x01000000u  /**<pmos open slice2 for 2port memories*/
#endif
/**@}*/

/**
  * \struct SL_PBIST_ExecStatus
  *
  * \brief Structure used to return the execution status of PBIST. This is used
  *         as a parmeter for the SL_SelfTest_PBIST_ExecStatus API.
  *
  */
typedef struct _SL_PBIST_FailInfo {
    SL_SelfTest_Result  stResult;           /**< Overall test status. TRUE if PBIST tests passed else FALSE */
    uint8               port0FailCount;     /**< Indicates number of failures on Port0 */
    uint8               port1FailCount;     /**< Indicates number for failures on Port1 */
    uint16              port0FailAddress;   /**< Contains address of first failure on Port0 */
    uint16              port1FailAddress;   /**< Contains address of first failure on Port1 */
    uint32              port0FailData;      /**< Failure data on Port0 */
    uint32              port1FailData;      /**< Failure data on Port1 */
} SL_PBIST_FailInfo;



/** \struct SL_STC_Config
  *
  * \brief STC Configuration information to be used with SL_SelfTest_STC API
  *
  */
typedef struct _SL_STC_Config {
    uint8        stcClockDiv;        /**< Supported values 0-7 */
    uint16         intervalCount;      /**< Max of 24 - Specifies the number of intervals to be ran from the value reflected in the current interval counter */
    boolean        restartInterval0;   /**< When TRUE to continue the run from next interval onwards or FALSE to restart from interval 0. */
    uint32         timeoutCounter;     /**<  Number of VBUS clock cycles to take before triggering timeout error (starting from intiation of run) */
} SL_STC_Config;



/** \struct SL_STC_FailInfo
  *
  * \brief STC failure information. Used in conjunction with SL_SelfTest_STC_Status API.
  *
  */
typedef struct _SL_STC_FailInfo {
    SL_SelfTest_Result    stResult;          /**< Result of self-test. */
    SL_SelfTest_Result     CPU1Failure;       /**< TRUE indicates Self-test run failure due to MISR mismatch for CPU1 */
    SL_SelfTest_Result     CPU2Failure;       /**< TRUE indicates Self-test run failure due to MISR mismatch for CPU2 */
    SL_SelfTest_Result     TimeOutFailure;    /**< TRUE indicates Self-test run failed due to a timeout error */
} SL_STC_FailInfo;


