pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/include/sl_types.h
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
/** \struct SL_PSCON_FailInfo
  *
  * \brief PSCON failure information. Used in with SL_SelfTest_PSCON_FailInfo API.
  *
  */
typedef struct _SL_PSCON_FailInfo {
    SL_SelfTest_Result  stResult;         /**< TRUE indicates PSCON Self test failure on Power or Memory domains */
    uint32              pdFailure;         /**< 1 on bits[3-0] indicate self test failure Power domain 5/4/3/2.  bits[19-16]: For PD5/4/3/2, 0 indicates compare match test failure & 1 indicates compare mistach test failure*/
    uint32              mdFailure;         /**< 1 on bits[2-0] indicate self test failure Memory Power domain 3/2/1.  bits[18-16]: For Memory Power Domain 3/2/1, 0 indicates compare match test failure & 1 indicates compare mistach test failure*/
} SL_PSCON_FailInfo;
#endif

/**
  * \enum       SL_EFuse_Error
  *
  * \brief      Error codes returned by EFuse controller when an operation is completed.
  *
  * \todo        Need to align this w.r.t TRM exposure
  */
typedef enum _SL_EFuse_Error {
  EFUSE_ERROR_NONE              = 0u,  /**< Last operation completed successfully */
  EFUSE_ERROR_TIMEOUT           = 1u,  /**< Controller times out because there is no last row sent from the FuseROM */
  EFUSE_ERROR_AUTOLOAD_1        = 2u,  /**< Autoload machine did not find enough FuseROM data to fill the scan chain */
  EFUSE_ERROR_AUTOLOAD_2        = 3u,  /**< The autoload machine was able to filll the scan chain, but the wrong signature was returned*/
  EFUSE_ERROR_AUTOLOAD_INTRPTD  = 4u,  /**< Autoload machine was not able or not allowed to complete its operation */
  EFUSE_ERROR_AUTOLOAD_2B_ERR   = 5u,  /**< 2Bit error detected during Autoload */
  EFUSE_ERROR_PROG_W_PROTECT    = 6u,  /**< The write protect bit of the chip/row address stored in the controller's address register is set to 1 */
  EFUSE_ERROR_PROG_W_D_ITER     = 7u,  /**< The number of times that the controller tried and failed to write r exceeded the maximum number of iterations allowed (16) */
  EFUSE_ERROR_PROG_CTRL_ITER    = 8u,  /**< The number of times that the controller tried and failed to write the control bits r exceeded the maximum number of iterations allowed (16) */
  EFUSE_ERROR_UNPROG_BIT_SET    = 9u,  /**< A bit was found to be set by the test unprogrammed FuseROM instruction */
  EFUSE_ERROR_RED_REP_ROW       =10u   /**< Two rows where the repair bit is set point to the same repair row. */
 }SL_EFuse_Error;



 /** \struct SL_EFuse_FailInfo
   *
   * \brief EFuse Self-test failure information.
   *
   */
 typedef struct _SL_EFuse_FailInfo {
     SL_SelfTest_Result  stResult;
     SL_EFuse_Error      failInfo;
 } SL_EFuse_FailInfo;


/**
  * \enum       SL_EFuse_Config
  *
  * \brief      Configuration parameters for eFuse ECC Self test
  *
  */
typedef struct _SL_EFuse_Config {
    uint32              numPatterns;        /**< Number of patterns/clock-cycles to be generated. The coverage saturates around 600 patterns at 99.6% */
    uint32              seedSignature;      /**< 32bit sginature as input to the eFuse self-test module */
    SL_EFuse_FailInfo      failInfo;
} SL_EFuse_Config;

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
typedef enum _SL_CCMR4F_Error {
   CCMR4F_ST_ERR_COMPARE_MATCH     = 1u,
   CCMR4F_ST_ERR_COMPARE_MISMATCH  = 2u
 } SL_CCMR4F_Error;

typedef struct _SL_CCMR4F_FailInfo {
    SL_SelfTest_Result  stResult;
    SL_CCMR4F_Error     failInfo;
}SL_CCMR4F_FailInfo;
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
typedef enum _SL_CCMR5F_Error {
    CCMR5F_ST_ERR_COMPARE_MATCH     = 1u,
    CCMR5F_ST_ERR_COMPARE_MISMATCH  = 2u
} SL_CCMR5F_Error;

typedef struct _SL_CCMR5F_FailInfo {
    SL_SelfTest_Result  stResult;
    SL_CCMR5F_Error     failInfo;
}SL_CCMR5F_FailInfo;
#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
/**
 * \enum       SL_ADC_Config
 *
 * \brief      Configuration parameters for ADC self test
 *
 */
typedef struct _SL_ADC_Config {
    sl_adcBASE_t* adcbase;    /**<base address of the adc used*/
    uint8 adc_channel;     /**<channel on which the self test needs to be performed*/
} SL_ADC_Config;

/** @enum adcGroups
 *   @brief Alias name for ADC event group
 *
 *   @note These values should be used for API argument @a group
 */
typedef enum _SL_ADC_Pinstatus {
    ADC_PIN_GOOD,                     /**<The pinstate of adc is good and is usable*/
    ADC_PIN_SHORTED_TO_ADVREF_HIGH,    /**<The pin of the ADC is shorted to ADVREF High*/
    ADC_PIN_SHORTED_TO_ADVREF_LOW,    /**<The pin of the ADC is shorted to ADVREF Low*/
    ADC_PIN_OPEN,                    /**<The pin of the ADC pin is open*/
    ADC_PIN_UNDETERMINED            /**<The pin of the ADC pin state is undetermined*/
} SL_ADC_Pinstatus;
#endif
#endif /* __SL_TYPES_H__ */

/*Comment_1:
 * "Reason -  ESM callback changes at runtime"*/
 
/*Comment_2:
 * "Reason -  Reviewed and the value assigned is an enumeration"*/
